In [2]:
import tensorflow
tensorflow.__version__

'2.6.0'

In [33]:
# importung all the required libraries
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler

# tensorflow libraries
import tensorflow
from tensorflow.keras.models import Sequential                  #FCL ANN sequential same
from tensorflow.keras.layers import Dense                       #to create a diff diff layers
from tensorflow.keras.layers import Dropout

In [ ]:
# upload the file

In [3]:
# check current direc
!pwd

/content

In [4]:
!ls

sample_data

In [5]:
# reading the file
data = pd.read_csv('Churn_Modelling.csv')
data.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [8]:
# second way
connect google drive with gogogle colab
files>>

SyntaxError: ignored

In [9]:
!pwd

/content

In [10]:
ls

Churn_Modelling.csv  sample_data/

In [11]:
cd /content

/content

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

In [ ]:
cd /content/drive/MyDrive

[Errno 2] No such file or directory: '/content/drive/MyDrive'
/content

In [12]:
ls

Churn_Modelling.csv  sample_data/

In [6]:
# reading the file
data = pd.read_csv('Churn_Modelling.csv')
data.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [7]:
# split
X = data.iloc[: , 3:13]
y = data.iloc[: ,13]

In [8]:
X

      CreditScore Geography  Gender  ...  HasCrCard  IsActiveMember  EstimatedSalary
0             619    France  Female  ...          1               1        101348.88
1             608     Spain  Female  ...          0               1        112542.58
2             502    France  Female  ...          1               0        113931.57
3             699    France  Female  ...          0               0         93826.63
4             850     Spain  Female  ...          1               1         79084.10
...           ...       ...     ...  ...        ...             ...              ...
9995          771    France    Male  ...          1               0         96270.64
9996          516    France    Male  ...          1               1        101699.77
9997          709    France  Female  ...          0               1         42085.58
9998          772   Germany    Male  ...          1               0         92888.52
9999          792    France  Female  ...          1               0         38190.78

[10000 rows x 10 columns]

In [9]:
geography = pd.get_dummies(X['Geography'],drop_first=True)
gender = pd.get_dummies(X['Gender'],drop_first=True)

In [10]:
X = pd.concat([X , geography,gender] , axis = 1)

In [11]:
X

      CreditScore Geography  Gender  Age  ...  EstimatedSalary  Germany  Spain  Male
0             619    France  Female   42  ...        101348.88        0      0     0
1             608     Spain  Female   41  ...        112542.58        0      1     0
2             502    France  Female   42  ...        113931.57        0      0     0
3             699    France  Female   39  ...         93826.63        0      0     0
4             850     Spain  Female   43  ...         79084.10        0      1     0
...           ...       ...     ...  ...  ...              ...      ...    ...   ...
9995          771    France    Male   39  ...         96270.64        0      0     1
9996          516    France    Male   35  ...        101699.77        0      0     1
9997          709    France  Female   36  ...         42085.58        0      0     0
9998          772   Germany    Male   42  ...         92888.52        1      0     1
9999          792    France  Female   28  ...         38190.78        0      0     0

[10000 rows x 13 columns]

In [12]:
X = X.drop(columns = ['Geography' , 'Gender'] , axis = 1)

In [13]:
X

      CreditScore  Age  Tenure  ...  Germany  Spain  Male
0             619   42       2  ...        0      0     0
1             608   41       1  ...        0      1     0
2             502   42       8  ...        0      0     0
3             699   39       1  ...        0      0     0
4             850   43       2  ...        0      1     0
...           ...  ...     ...  ...      ...    ...   ...
9995          771   39       5  ...        0      0     1
9996          516   35      10  ...        0      0     1
9997          709   36       7  ...        0      0     0
9998          772   42       3  ...        1      0     1
9999          792   28       4  ...        0      0     0

[10000 rows x 11 columns]

In [14]:
# splitting dataset
X_train , X_test , y_train , y_test = train_test_split(X , y , test_size = 0.2 , random_state = 101)

In [15]:
# feature scaling  -->  for giving equal weightege for all the columns
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

In [25]:
X_train.shape

(8000, 11)

In [ ]:
# 1 - architecture creation - where we define the architecture
# 2.compile - we tell that how the loss will be calculated , which will be the loss parameter ,whih will be the metrics parametr to calculate the loss
# 3.model train -

In [34]:
# 1 .architecture creation

model = Sequential()
model.add(Dense(100,activation = 'relu' , kernel_initializer='he_uniform'))     #hidden layer 1
model.add(Dropout(0.2))                                                         # 20% neurons of hidden layer 1 (we will have dropout for each hidden layer)

model.add(Dense(50,activation = 'sigmoid'))                                     #hidden layer 2
model.add(Dropout(0.5))

model.add(Dense(25,activation = 'relu' , kernel_initializer='he_normal'))       #hidden layer 3

model.add(Dense(12,activation = 'relu' , kernel_initializer='he_uniform'))      #hidden layer 4

model.add(Dense(1,activation = 'sigmoid'))                                      #output layer (last layer alwys wil be output layer and we have to remember neuron count)

In [35]:
# compile

model.compile(optimizer='SGD' , loss = 'binary_crossentropy' , metrics = ['accuracy'])

In [36]:
# model train
model.fit(X_train , y_train , epochs = 10 , batch_size=32)

#epochs - number of iteration of forward propagation and back propagation , all the data should be seen in each epochs.
# batch size = 32 - each batch will have a size of 32

Epoch 1/10
250/250 [==============================] - 1s 3ms/step - loss: 0.5258 - accuracy: 0.7893
Epoch 2/10
250/250 [==============================] - 1s 3ms/step - loss: 0.5038 - accuracy: 0.7980
Epoch 3/10
250/250 [==============================] - 1s 3ms/step - loss: 0.4967 - accuracy: 0.7981
Epoch 4/10
250/250 [==============================] - 1s 3ms/step - loss: 0.4900 - accuracy: 0.7986
Epoch 5/10
250/250 [==============================] - 1s 3ms/step - loss: 0.4881 - accuracy: 0.7979
Epoch 6/10
250/250 [==============================] - 1s 3ms/step - loss: 0.4831 - accuracy: 0.7980
Epoch 7/10
250/250 [==============================] - 1s 3ms/step - loss: 0.4781 - accuracy: 0.7979
Epoch 8/10
250/250 [==============================] - 1s 3ms/step - loss: 0.4722 - accuracy: 0.7985
Epoch 9/10
250/250 [==============================] - 1s 3ms/step - loss: 0.4721 - accuracy: 0.7981
Epoch 10/10
250/250 [==============================] - 1s 3ms/step - loss: 0.4675 - accuracy: 0.7972

In [ ]:
# hyperparameter to gt the accurate (best) accuracy
# 1. no of neurons
# 2. hidden layers
# 3. activatio function
# 4. epoch
# 5. batches
# 6. optimizers

In [ ]:
#--->>> task
# play with parameters
# try to do with ANN

In [37]:
# testing the data , check the accuracy on ---
model.evaluate(X_test , y_test)

63/63 [==============================] - 0s 2ms/step - loss: 0.4537 - accuracy: 0.7885

[0.4537034332752228, 0.7885000109672546]

In [ ]:
# In above---->>
# 0.38951751589775085 - loss
# 0.8295000195503235 - accuracy

In [ ]:
# Next step is to save the model and we have to remember that pkl and sav used to save in machine learning only 
# but in deep learning we have diff ways to save the model , we will see below---

In [38]:
import joblib

joblib.dump(sc , 'feature_scaling.pkl')

# use pkl to send the data from training.py to main.py


# save the model
# Firstly we have to give the model name then . and then save (file name) -->> extension of deep learning model is h5


model.save('20_aug_82.h5')

In [39]:
# Next loading the model

from keras.models import load_model
model_load = load_model('20_aug_82.h5')

In [24]:
# predict the model
model_load.predict(X_test)

array([[0.07710368],
       [0.02992798],
       [0.31451288],
       ...,
       [0.12124267],
       [0.05620936],
       [0.28546607]], dtype=float32)

In [26]:
y_pred = model_load.predict(X_test) > 0.5         # 0.5 is threshold in logistic regression but not alwys 0.5 ,its totally depends on AUC and ROC curve
                                                  # 0.3 also can give the better result
                                                  # not alwys 0.5

In [27]:
y_pred

array([[False],
       [False],
       [False],
       ...,
       [False],
       [False],
       [False]])

In [41]:
a = 10
b = 10
c = 1000
d = 10
e = 10
f = 10
g = 1000
h = 10
i = 10
j = 1000
k = 10

scaling = joblib.load('feature_scaling.pkl')

data = scaling.transform([[a,b,c,d,e,f,g,h,i,j,k]])
print(data)

output = model_load.predict(data)                                               #>>> binary classification
if output[0][0] == True:
  print('He/She will leave')
else:
  print('He/She will stay')

[[-6.63822406e+00 -2.74296341e+00  3.42749985e+02 -1.23334973e+00
   1.45786704e+01  2.04043525e+01  1.99945124e+03 -1.73806172e+00
   2.25654364e+01  2.32055176e+03  1.89868748e+01]]
He/She will stay

In [ ]:
# practice >>>>> need to revise
# AUC and ROC curve --->Read
# All the loss  function should learn that how loss func will works
# gradient descent
# All types of activation function
# All types of optimizers

In [ ]:
# In machine learning term - Regularization - >>>> Used to prevent overfitting
# In Deep learning term - Drop out -> only for training it works not for testing data
# Drop out is a technique to reduce the overfitting

#Will try with drop out as well

In [ ]:
# Note - Dropout is only allowed in hidden layers not in output layers
#      - the value of dropout is between 0 to 1
#      - it is hyperparameter tuning

In [ ]:
# "Deep Learning model will never lead to underfit"  has to prove? 
# Hence there is a proof for this that deep learning will never lead to underfit- graph called as bias v/s variance tradeoff
# Reason is if model is complex variance will increase i.e overfitting will happen and if model is less complex then bias will increase i.e underfitting happen
# Important graph of machine learning - interview based also

# underfit means it is not well peformed on the training as well as on testing data

In [ ]:
# Note - pipeline - pipeline has to be followed.

# While training Suppose we have data --> scaling -->fit
# While testing --> data -> scaling --> predict